In [4]:
import pandas as pd

In [9]:
message = pd.read_csv("C:/Users/ander/LightHouseNotes/mini-project-III/Data/twm_customer.csv", sep = ";")
message.head(3)

,cust_id,income,age,years_with_bank,nbr_children,gender,marital_status,name_prefix,first_name,last_name,street_nbr,street_name,postal_code,city_name,state_code
0,1362691,26150,46,5,1,M,2,,Donald ...,Marek ...,8298,Second ...,89194,Las Vegas,NV
1,1362487,6605,71,1,0,M,2,,ChingDyi ...,Moussavi ...,10603,Daffodil ...,90159,Los Angeles,CA
2,1363160,18548,38,8,0,F,1,,Rosa ...,Johnston ...,8817,Figueroa ...,90024,Los Angeles,CA

In [12]:
message.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 747 entries, 0 to 746
Data columns (total 15 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   cust_id          747 non-null    int64
 1   income           747 non-null    int64
 2   age              747 non-null    int64
 3   years_with_bank  747 non-null    int64
 4   nbr_children     747 non-null    int64
 5   gender           747 non-null    object
 6   marital_status   747 non-null    int64
 7   name_prefix      747 non-null    object
 8   first_name       747 non-null    object
 9   last_name        747 non-null    object
 10  street_nbr       747 non-null    int64
 11  street_name      747 non-null    object
 12  postal_code      747 non-null    int64
 13  city_name        747 non-null    object
 14  state_code       747 non-null    object
dtypes: int64(8), object(7)
memory usage: 87.7+ KB

In [6]:
message.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 747 entries, 0 to 746
Data columns (total 15 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   cust_id          747 non-null    int64
 1   income           747 non-null    int64
 2   age              747 non-null    int64
 3   years_with_bank  747 non-null    int64
 4   nbr_children     747 non-null    int64
 5   gender           747 non-null    object
 6   marital_status   747 non-null    int64
 7   name_prefix      747 non-null    object
 8   first_name       747 non-null    object
 9   last_name        747 non-null    object
 10  street_nbr       747 non-null    int64
 11  street_name      747 non-null    object
 12  postal_code      747 non-null    int64
 13  city_name        747 non-null    object
 14  state_code       747 non-null    object
dtypes: int64(8), object(7)
memory usage: 87.7+ KB